[
  {
    "id": "goal-1",
    "goalName": "Proctively work with detainees to manage behaviour ",
    "goalDesc": "1. Talk to each of the detainees you are responsible for each shift. \n\n2. Read the detainee CAMS goals each week.\n\n3. Follow the Psychologist's advice and strategies when working with a detainee. \n\n4. Read the Detainee Behaviour Intervention Framework Policy and documents."
  },
  {
    "id": "goal-2",
    "goalName": "Act up as a Caseworker",
    "goalDesc": "1. Read the Caseworker role description and identify the capabilities you need to work on.\n\n2.Apply through an EOI for a Caseworker role.\n\n3. Talk to the Area Manager or Centre Manager where you want to work about your work experience to find out whether it is considered equivanlent experience or if you need a diploma.\n\n4. Complete a Diploma in Community Services or equivalent through an RTO eg. TAFE."
  },
  {
    "id": "goal-3",
    "goalName": "Buddy up with a new employee",
    "goalDesc": "1. Ask your manager if you can buddy a new employee\n\n2. Observe the new staff member and how they work\n\n3. Identify an area where they need to improve on in relation to the policies and procedures\n\n4. Find out what the staff member knows about the policy/procuedre and how they are applying it\n\n5. Decide on teh best approach - role model what you would like the staf fmember to do or provide some tips\n\n6. Advise the new staff member on how to find the policy/procedure\n\n7. Continue to observe and support the staff member to improve"
  },
  {
    "id": "goal-4",
    "goalName": "Complete a YLS/CMI-AA",
    "goalDesc": "1. Obtain approval from management to complete a YLS/CMI-AA for a new detainee with a caseworker.\n\n2. Read the Case Management and YLS/CMI-AA policies\n\n3. Review CIMS including the criminal history, reports and case notes\n\n4. Talk to the Caseworker about how to find out information from the detainee.\n\n5. Get to know the detainee and ask them about their life outside of custody\n\n6. Complete the YLS/CMI-AA with the Caseworker's guidance,\n\n7. Identify the detainees needs and make referrals to services in the centre as required."
  },
  {
    "id": "goal-5",
    "goalName": "Develop a communication strategy for working with a difficult detainee",
    "goalDesc": "1. Identify a detainee on your unit that staff are having difficulties with.\n\n2. Talk to the staff on your team and at change over to find out what has been working/not working.\n\n3. Talk to the Pyshcologist and get some strategies to work with the detainee.\n\n4. Try out each strategy at least 4 times and see which/if there is improvement with the detainee.\n\n5. Advise the team on how they approaches went and provide support to the team in implementing the approach."
  },
  {
    "id": "goal-6",
    "goalName": "Set up and run a program on your unit.",
    "goalDesc": "1. Identify a program which could be added to the current programs available at your centre.\n\n2. Using a GANTT chart, write out the activities, timeframes and approvals you need.\n\n3. Write a program outline (including the costs of the program) and risk assessment for the items included.\n\n4. Submit the program to the WH&S committee for review\n\n5. Write a submission including the GANTT chart, program outline and risk assessment for the centre management team to approve.\n\n6. Set up and run the program following the steps in your GANTT chart."
  },
  {
    "id": "goal-7",
    "goalName": "Run a CAMS session on your unit",
    "goalDesc": "1. Ask your manager if you could run a CAMS session with a detainee.\n\n2. Sit in a CAMS meeting and watch  how your manager runs the meeting.\n\n3. Review the CAMS meeting forms and identify the information you need to run it.\n\n4. Gather information from points sheets, CIMS, unit staff, caseworkers, Psych, Justice Health and Education.\n\n5. Review the goals and all information including MR's and incidents.\n\n6. Talk to your manager about how plan to run the meeting and what you intend to talk to the detainee about.\n\n7. Run the CAMS meeting and talk to your manager about how it went."
  },
  {
    "id": "goal-8",
    "goalName": "Act with Integrity 1",
    "goalDesc": "1. Consider how staff on your unit treat detainees?\n\n2. Can you identify how they use the Department's values when working with the detainees?\n\n3. Buddy up with a new starter and help them understand what the values mean when working detaineeseg.:\n - being respectful to detainees\n - not favouring detainees\n - how being equitable means that you may need to treat detainees differently\n\n4. Provide feedback to the staff member on their approach with the detainees. "
  },
  {
    "id": "goal-9",
    "goalName": "Act with Integrity 2",
    "goalDesc": "1. Talk to your manager about two detainees on your unit, who share similar behaviours but you have used different types of intervention to meet their needs eg. intellectual disability, mental health, age etc.\n\n2. Identify how your approach and why you chose different actions. \n\n3. Are you satisfied that your approach met the deparment's values, and procedures?\n\n4. Did your manager provide you with further guidance?"
  },
  {
    "id": "goal-10",
    "goalName": "Act with Integrity 3",
    "goalDesc": "1. Complete the Code of Conduct LMS module\n\n2. Complete the Cert IV in Youth Justice"
  },
  {
    "id": "goal-11",
    "goalName": "Commit to Customer Service 1",
    "goalDesc": "1. In your team identify the key responsibilities it has for providing customer service to detainees.\n\n2. Discuss with your team the key areas it needs to improve on to ensure detainee needs are met.\n\n3. Develop a plan to address one of the key areas and how the team will work on it.\n\n4. Keep a factual record of the changes and identify if the team has imrpoved, stayed the same or not improved."
  },
  {
    "id": "goal-12",
    "goalName": "Commit to Customer Service 2",
    "goalDesc": "1. Talk to your pmanager about your plan to work on improving customer service skills within the team.\n\n2. Write and submit to your manager a plan of action on how you intend to address the key areas and how you will measure success.\n\n3. With the team and manager reflect on the successes, progress and improvements for the team."
  },
  {
    "id": "goal-13",
    "goalName": "Commit to Customer Service 3",
    "goalDesc": "1. Review the Youth Justice Business Plan to identify service delivery indicators which relate to the Caseworker role.\n\n2. Using the indicators from the business plan, identify and complete LMS modules to develop your knowledge in this area."
  },
  {
    "id": "goal-14",
    "goalName": "Communicate Effectively 1",
    "goalDesc": "1. Identify a misbehaviour that happens frequently on your unit and discuss with your manager how it can be improved.\n\n2. Present your strategies to reduce the misbehaviour to your team.\n\n3. Provide data from CIMS on MR's to support your recommendations.\n\n4. Anticipate potential objections and have answers ready for these.\n\n5. Review your presentation to the team, did you get buy in?\n\n6. Were you adequately prepared?\nWhat would you do differently next time?"
  },
  {
    "id": "goal-15",
    "goalName": "Communicate Effectively 2",
    "goalDesc": "1. Talk to your manager about what worked well during the implementation?\n\n2. Did your plan achieve the outcomes you set out.\n\n3. Did the staff get on board? How did you keep them motivated?\nWhat would you change?"
  },
  {
    "id": "goal-16",
    "goalName": "Communicate Effectively 3",
    "goalDesc": "1. Complete casework and report modules on the LMS.\n\n2. With your manager's support to apply for training for key programs eg. CHART"
  },
  {
    "id": "goal-17",
    "goalName": "Project Management 1",
    "goalDesc": "1. Review the casework procedure and identify the different tasks that need to be completed for a client in the community.\n\n2. Using the information, draw a GANTT chart stepping out the supervision process for a community based client.\n\n3. Talk to a caseworker about the case management process and issues that impact on completing case maangement tasks withing timeframes.\n\n4. Review the GANTT chart adding in additional steps and adjust timeframes as required.\n"
  },
  {
    "id": "goal-18",
    "goalName": "Project Management 2",
    "goalDesc": "1. Review the GANTT chart with a Caseworker identifying any risks or potential changes during supervision.\n\n2. What would you do differently.\n\n3. Where you have identified risks, what would you do to keep the supervision on track and the client supported?"
  },
  {
    "id": "goal-19",
    "goalName": "Project Management 3",
    "goalDesc": "1. Complete a Cert IV or Diploma in Project Management\n\n2. Read the PMBOK Guide and Standards"
  },
  {
    "id": "goal-20",
    "goalName": "Think and Solve Problems 1",
    "goalDesc": "1. Identify an area your team could improve on. \n\n2. Talk to your team about the issues and how it could be improved.\n\n3. Identify the best strategy for the team.\n\n4. Put the strategy to the team."
  },
  {
    "id": "goal-21",
    "goalName": "Think and Solve Problems 2",
    "goalDesc": "1. Debrief with your manager on the changes.\n\n2. What worked well and is there anything that needs to be changed?\n\n3. Is the strategy working?\n\n4. What did you learn?"
  },
  {
    "id": "goal-22",
    "goalName": "Think and Solve Problems 3",
    "goalDesc": "1. Complete the LMS Casework LMS modules including case management, YLS/CMI-AA and reports\n\n2. Complete the Diploma in Community Services"
  }
]
